# 
# 문제
# 구구 구구구 구구구 구구구구구구 구구구구 구구구구 구구구 구구구
# 구구구 구구구 구구구구구 구구구구 구구구 구구구구구구 구구
# 구구구 구구구 구구구구구 구구구구 구구 구구구구 구구구구구 구구구구
# 구 구구구구 구구구구 구 구구구구 구구 구구구구
# 
# 구구 구구구구 구구구구구 구구구 구구구구구구구, 구구 구구구 구구구구구
# 구구 구 구구구구구 구구구구 구구구구구구 구구구 구구구구 구구구
# 구구구구 구구'구 구구구구구구 구구구구 구구구구구구구구
# 구구구구 구구구 구구구, 구'구구 구구구구 구 구구구구 구구 구구구구
# 
# 구 구구구구구구구구 구구구구 구구구구구구구
# 구구구 구구구구구 구구구구 구구구구구구 구구구구 구구구구
# 구구구 구구 구구구구구 구구구구구구 구구 구구구구
# 구구구구 구구구구, 구구구 구구구구구 구구구구구구
# 구구구구 구구구구 구구구구 구구구구, "구구 구구구구"
# 구구구 구구 구구구구구 구구구구구구 구구 구구구구
# 
# 구구 구구구 구구구 구구 구구구 구구 구구구 구구구구구구구
# 구구구 구구구 구구구구 구구구구 구구 구구구구 구구구구 구구구 구구구
# 구구 구구 구구구구구 구구구 구구구구 구구구구구구 구구구구
# 구 구구구구 구구구구 구 구구구구 구구 구구구구
# 
# 구구구구구 구구구 구구구구 구구구구 구구구구 구구구구구구구구구
# 구구 구구구 구구구구, 구구구구구 구구구 구구 구구구구구구구
# 구구구구 구구 구구구구구 구구구구구구 구구구구 구구 구구구구구구
# 구구구구 구구구 구구구, 구'구구 구구구구 구 구구구구 구구 구구구구
# 
# 입력
# 구구가 부른 노래가 입력으로 주어진다.
# 
# 출력
# 구구가 부른 노래의 제목을 출력한다.

print("Hymn To Love")
